espressif/esp-idf/components/soc/esp32h4/register/soc/pcnt_reg.h
/** PCNT_U2_STATUS_REG register
 *  PNCT UNIT2 status register
 */
#define PCNT_U2_STATUS_REG (DR_REG_PCNT_BASE + 0x68)
/** PCNT_CNT_THR_ZERO_MODE_U2 : RO; bitpos: [1:0]; default: 0;
 *  Represents the pulse counter status of PCNT_U2 corresponding to 0.
 *  0: pulse counter decreases from positive to 0
 *  1: pulse counter increases from negative to 0
 *  2: pulse counter is negative
 *  3: pulse counter is positive
 */
#define PCNT_CNT_THR_ZERO_MODE_U2    0x00000003U
#define PCNT_CNT_THR_ZERO_MODE_U2_M  (PCNT_CNT_THR_ZERO_MODE_U2_V << PCNT_CNT_THR_ZERO_MODE_U2_S)
#define PCNT_CNT_THR_ZERO_MODE_U2_V  0x00000003U
#define PCNT_CNT_THR_ZERO_MODE_U2_S  0
/** PCNT_CNT_THR_THRES1_LAT_U2 : RO; bitpos: [2]; default: 0;
 *  Represents the latched value of thres1 event of PCNT_U2 when threshold event
 *  interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to thres1 and thres1 event is valid
 */
#define PCNT_CNT_THR_THRES1_LAT_U2    (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U2_M  (PCNT_CNT_THR_THRES1_LAT_U2_V << PCNT_CNT_THR_THRES1_LAT_U2_S)
#define PCNT_CNT_THR_THRES1_LAT_U2_V  0x00000001U
#define PCNT_CNT_THR_THRES1_LAT_U2_S  2
/** PCNT_CNT_THR_THRES0_LAT_U2 : RO; bitpos: [3]; default: 0;
 *  Represents the latched value of thres0 event of PCNT_U2 when threshold event
 *  interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to thres0 and thres0 event is valid
 */
#define PCNT_CNT_THR_THRES0_LAT_U2    (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U2_M  (PCNT_CNT_THR_THRES0_LAT_U2_V << PCNT_CNT_THR_THRES0_LAT_U2_S)
#define PCNT_CNT_THR_THRES0_LAT_U2_V  0x00000001U
#define PCNT_CNT_THR_THRES0_LAT_U2_S  3
/** PCNT_CNT_THR_L_LIM_LAT_U2 : RO; bitpos: [4]; default: 0;
 *  Represents the latched value of low limit event of PCNT_U2 when threshold event
 *  interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to thr_l_lim and low limit event is valid.
 */
#define PCNT_CNT_THR_L_LIM_LAT_U2    (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U2_M  (PCNT_CNT_THR_L_LIM_LAT_U2_V << PCNT_CNT_THR_L_LIM_LAT_U2_S)
#define PCNT_CNT_THR_L_LIM_LAT_U2_V  0x00000001U
#define PCNT_CNT_THR_L_LIM_LAT_U2_S  4
/** PCNT_CNT_THR_H_LIM_LAT_U2 : RO; bitpos: [5]; default: 0;
 *  Represents the latched value of high limit event of PCNT_U2 when threshold event
 *  interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to thr_h_lim and high limit event is valid.
 */
#define PCNT_CNT_THR_H_LIM_LAT_U2    (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U2_M  (PCNT_CNT_THR_H_LIM_LAT_U2_V << PCNT_CNT_THR_H_LIM_LAT_U2_S)
#define PCNT_CNT_THR_H_LIM_LAT_U2_V  0x00000001U
#define PCNT_CNT_THR_H_LIM_LAT_U2_S  5
/** PCNT_CNT_THR_ZERO_LAT_U2 : RO; bitpos: [6]; default: 0;
 *  Represents the latched value of zero threshold event of PCNT_U2 when threshold
 *  event interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to 0 and zero threshold event is valid.
 */
#define PCNT_CNT_THR_ZERO_LAT_U2    (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U2_M  (PCNT_CNT_THR_ZERO_LAT_U2_V << PCNT_CNT_THR_ZERO_LAT_U2_S)
#define PCNT_CNT_THR_ZERO_LAT_U2_V  0x00000001U
#define PCNT_CNT_THR_ZERO_LAT_U2_S  6
/** PCNT_CNT_THR_H_STEP_LAT_U2 : RO; bitpos: [7]; default: 0;
 *  Represents the latched value of step counter event of PCNT_U2 when step counter
 *  event interrupt is valid. 1: the current pulse counter decrement equals to
 *  reg_cnt_step and step counter event is valid. 0: others
 */
#define PCNT_CNT_THR_H_STEP_LAT_U2    (BIT(7))
#define PCNT_CNT_THR_H_STEP_LAT_U2_M  (PCNT_CNT_THR_H_STEP_LAT_U2_V << PCNT_CNT_THR_H_STEP_LAT_U2_S)
#define PCNT_CNT_THR_H_STEP_LAT_U2_V  0x00000001U
#define PCNT_CNT_THR_H_STEP_LAT_U2_S  7
/** PCNT_CNT_THR_L_STEP_LAT_U2 : RO; bitpos: [8]; default: 0;
 *  Represents the latched value of step counter event of PCNT_U2 when step counter
 *  event interrupt is valid. 1: the current pulse counter increment equals to
 *  reg_cnt_step and step counter event is valid. 0: others
 */
#define PCNT_CNT_THR_L_STEP_LAT_U2    (BIT(8))
#define PCNT_CNT_THR_L_STEP_LAT_U2_M  (PCNT_CNT_THR_L_STEP_LAT_U2_V << PCNT_CNT_THR_L_STEP_LAT_U2_S)
#define PCNT_CNT_THR_L_STEP_LAT_U2_V  0x00000001U
#define PCNT_CNT_THR_L_STEP_LAT_U2_S  8

/** PCNT_U3_STATUS_REG register
 *  PNCT UNIT3 status register
 */
#define PCNT_U3_STATUS_REG (DR_REG_PCNT_BASE + 0x6c)
/** PCNT_CNT_THR_ZERO_MODE_U3 : RO; bitpos: [1:0]; default: 0;
 *  Represents the pulse counter status of PCNT_U3 corresponding to 0.
 *  0: pulse counter decreases from positive to 0
 *  1: pulse counter increases from negative to 0
 *  2: pulse counter is negative
 *  3: pulse counter is positive
 */
#define PCNT_CNT_THR_ZERO_MODE_U3    0x00000003U
#define PCNT_CNT_THR_ZERO_MODE_U3_M  (PCNT_CNT_THR_ZERO_MODE_U3_V << PCNT_CNT_THR_ZERO_MODE_U3_S)
#define PCNT_CNT_THR_ZERO_MODE_U3_V  0x00000003U
#define PCNT_CNT_THR_ZERO_MODE_U3_S  0
/** PCNT_CNT_THR_THRES1_LAT_U3 : RO; bitpos: [2]; default: 0;
 *  Represents the latched value of thres1 event of PCNT_U3 when threshold event
 *  interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to thres1 and thres1 event is valid
 */
#define PCNT_CNT_THR_THRES1_LAT_U3    (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U3_M  (PCNT_CNT_THR_THRES1_LAT_U3_V << PCNT_CNT_THR_THRES1_LAT_U3_S)
#define PCNT_CNT_THR_THRES1_LAT_U3_V  0x00000001U
#define PCNT_CNT_THR_THRES1_LAT_U3_S  2
/** PCNT_CNT_THR_THRES0_LAT_U3 : RO; bitpos: [3]; default: 0;
 *  Represents the latched value of thres0 event of PCNT_U3 when threshold event
 *  interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to thres0 and thres0 event is valid
 */
#define PCNT_CNT_THR_THRES0_LAT_U3    (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U3_M  (PCNT_CNT_THR_THRES0_LAT_U3_V << PCNT_CNT_THR_THRES0_LAT_U3_S)
#define PCNT_CNT_THR_THRES0_LAT_U3_V  0x00000001U
#define PCNT_CNT_THR_THRES0_LAT_U3_S  3
/** PCNT_CNT_THR_L_LIM_LAT_U3 : RO; bitpos: [4]; default: 0;
 *  Represents the latched value of low limit event of PCNT_U3 when threshold event
 *  interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to thr_l_lim and low limit event is valid.
 */
#define PCNT_CNT_THR_L_LIM_LAT_U3    (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U3_M  (PCNT_CNT_THR_L_LIM_LAT_U3_V << PCNT_CNT_THR_L_LIM_LAT_U3_S)
#define PCNT_CNT_THR_L_LIM_LAT_U3_V  0x00000001U
#define PCNT_CNT_THR_L_LIM_LAT_U3_S  4
/** PCNT_CNT_THR_H_LIM_LAT_U3 : RO; bitpos: [5]; default: 0;
 *  Represents the latched value of high limit event of PCNT_U3 when threshold event
 *  interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to thr_h_lim and high limit event is valid.
 */
#define PCNT_CNT_THR_H_LIM_LAT_U3    (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U3_M  (PCNT_CNT_THR_H_LIM_LAT_U3_V << PCNT_CNT_THR_H_LIM_LAT_U3_S)
#define PCNT_CNT_THR_H_LIM_LAT_U3_V  0x00000001U
#define PCNT_CNT_THR_H_LIM_LAT_U3_S  5
/** PCNT_CNT_THR_ZERO_LAT_U3 : RO; bitpos: [6]; default: 0;
 *  Represents the latched value of zero threshold event of PCNT_U3 when threshold
 *  event interrupt is valid.
 *  0: others
 *  1: the current pulse counter equals to 0 and zero threshold event is valid.
 */
#define PCNT_CNT_THR_ZERO_LAT_U3    (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U3_M  (PCNT_CNT_THR_ZERO_LAT_U3_V << PCNT_CNT_THR_ZERO_LAT_U3_S)
#define PCNT_CNT_THR_ZERO_LAT_U3_V  0x00000001U
#define PCNT_CNT_THR_ZERO_LAT_U3_S  6
/** PCNT_CNT_THR_H_STEP_LAT_U3 : RO; bitpos: [7]; default: 0;
 *  Represents the latched value of step counter event of PCNT_U3 when step counter
 *  event interrupt is valid. 1: the current pulse counter decrement equals to
 *  reg_cnt_step and step counter event is valid. 0: others
 */
#define PCNT_CNT_THR_H_STEP_LAT_U3    (BIT(7))
#define PCNT_CNT_THR_H_STEP_LAT_U3_M  (PCNT_CNT_THR_H_STEP_LAT_U3_V << PCNT_CNT_THR_H_STEP_LAT_U3_S)
#define PCNT_CNT_THR_H_STEP_LAT_U3_V  0x00000001U
#define PCNT_CNT_THR_H_STEP_LAT_U3_S  7
/** PCNT_CNT_THR_L_STEP_LAT_U3 : RO; bitpos: [8]; default: 0;
 *  Represents the latched value of step counter event of PCNT_U3 when step counter
 *  event interrupt is valid. 1: the current pulse counter increment equals to
 *  reg_cnt_step and step counter event is valid. 0: others
 */
#define PCNT_CNT_THR_L_STEP_LAT_U3    (BIT(8))
#define PCNT_CNT_THR_L_STEP_LAT_U3_M  (PCNT_CNT_THR_L_STEP_LAT_U3_V << PCNT_CNT_THR_L_STEP_LAT_U3_S)
#define PCNT_CNT_THR_L_STEP_LAT_U3_V  0x00000001U
#define PCNT_CNT_THR_L_STEP_LAT_U3_S  8

